// Console.WriteLine("Привет!");
// //int a = 2;
// int a = Convert.ToInt32(Console.ReadLine());
// //Console.WriteLine($"Quad of {a} -> {a*a}");
// int Quad = a * a;
// Console.WriteLine(Quad);
// Задача 2. Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго.
int x1 = Console.WriteLine("Привет!");

// Задача 4. 1. Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает **последнюю** цифру этого числа.
    
    // 456 -> 6
    
    // 782 -> 2
    
    // 918 -> 8 

    